{"id":"wahle2024","title":"IMBAS-MS Discovers Organ-Specific HLA Peptide Patterns in Plasma","authors":"Maria Wahle, Marvin Thielert, Maximilian Zwiebel, Patricia Skowronek, Wen-Feng Zeng, Matthias Mann","journal":"Molecular & Cellular Proteomics","year":"2024","doi":"10.1016/j.mcpro.2023.100671","url":"https://www.mcponline.org/article/S1535-9476(23)00200-1/fulltext","keyAssumptions":"Large plasma volumes (mL scale) required for immunopeptidomics; Complex workflows limit clinical translation","keyHypotheses":"Automated small-volume approaches can enable clinical-scale immunopeptidomics; Plasma HLA peptides reflect tissue-specific origins","strengths":"Automated workflow, 200μL plasma requirement, 30min analysis time, >5000 peptides identified","weaknesses":"Limited to specific HLA types, requires specialized equipment","citation":"Wahle, M., et al. (2024). IMBAS-MS Discovers Organ-Specific HLA Peptide Patterns in Plasma. Mol Cell Proteomics.","notes":"Revolutionary reduction in sample volume requirements. Enables clinical translation of immunopeptidomics.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"walz2023","title":"TOFIMS mass spectrometry-based immunopeptidomics refines tumor antigen discovery","authors":"Juliane S. Walz, et al.","journal":"Nature Communications","year":"2023","doi":"10.1038/s41467-023-42692-7","url":"https://www.nature.com/articles/s41467-023-42692-7","keyAssumptions":"Standard Orbitrap MS represents technical ceiling for immunopeptidomics sensitivity","keyHypotheses":"Ion mobility separation can improve immunopeptidomics sensitivity without specificity loss","strengths":"Higher sensitivity, improved MS/MS scan rates, better tumor antigen discovery","weaknesses":"Requires specialized instrumentation, limited comparative data","citation":"Walz, J.S., et al. (2023). TOFIMS mass spectrometry-based immunopeptidomics refines tumor antigen discovery. Nat Commun 14, 7574.","notes":"Next-generation MS technology for immunopeptidomics. Challenges assumed technical limitations.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"bruno2023","title":"High-throughput, targeted MHC class I immunopeptidomics using a functional genetics screening platform","authors":"Peter M Bruno, Richard T Timms, et al.","journal":"Nature Biotechnology","year":"2023","doi":"10.1038/s41587-022-01566-x","url":"https://www.nature.com/articles/s41587-022-01566-x","keyAssumptions":"Discovery-based MS is the only unbiased approach to identify MHC ligands","keyHypotheses":"Functional genetics can enable targeted immunopeptidomics; MHC trafficking requires stable peptide binding","strengths":"High-throughput, targeted approach, functional validation built-in","weaknesses":"Requires prior knowledge of target sequences, limited to known proteins","citation":"Bruno, P.M., et al. (2023). High-throughput, targeted MHC class I immunopeptidomics using a functional genetics screening platform. Nat Biotechnol 41, 980-992.","notes":"EpiScan platform enables focused analysis. Complements discovery approaches.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"kubiniok2022","title":"Understanding the constitutive presentation of MHC class I immunopeptidomes in primary tissues","authors":"Peter Kubiniok, Ana Marcu, Leon Bichmann, et al.","journal":"iScience","year":"2022","doi":"10.1016/j.isci.2022.103768","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC8810409/","keyAssumptions":"Protein abundance is primary determinant of MHC presentation; Presentation patterns are largely random","keyHypotheses":"MHC immunopeptidome follows systematic, evolutionarily conserved patterns; Tissue-specific biases exist independent of abundance","strengths":"Cross-species analysis, primary tissue focus, evolutionary conservation evidence","weaknesses":"Limited tissue types analyzed, technical replication challenges","citation":"Kubiniok, P., et al. (2022). Understanding the constitutive presentation of MHC class I immunopeptidomes in primary tissues. iScience 25, 103768.","notes":"Fundamental discovery of systematic presentation biases. Key paper for our project.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"mamrosh2023","title":"Quantitative measurement of the requirement of diverse protein degradation pathways in MHC class I peptide presentation","authors":"Jennifer L Mamrosh, David J Sherman, et al.","journal":"Science Advances","year":"2023","doi":"10.1126/sciadv.ade7890","url":"https://www.science.org/doi/10.1126/sciadv.ade7890","keyAssumptions":"All MHC class I peptides require ubiquitin-proteasome system for generation","keyHypotheses":"Alternative degradation pathways contribute significantly to MHC presentation; UPS-independent pathways exist","strengths":"Systematic pathway analysis, quantitative measurements, comprehensive inhibitor studies","weaknesses":"Limited to cell lines, artificial inhibition conditions","citation":"Mamrosh, J.L., et al. (2023). Quantitative measurement of the requirement of diverse protein degradation pathways in MHC class I peptide presentation. Sci Adv 9, eade7890.","notes":"30% of MHC peptides are UPS-independent. Challenges fundamental assumption.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"hardy2021","title":"Most non-canonical proteins uniquely populate the proteome or immunopeptidome","authors":"Marie-Pierre Hardy, Maria Virginia Ruiz Cuevas, et al.","journal":"Cell Reports","year":"2021","doi":"10.1016/j.celrep.2021.108815","url":"https://www.cell.com/cell-reports/retrieve/pii/S2211124721001297","keyAssumptions":"Canonical proteins dominate MHC presentation; Non-canonical contributions are negligible","keyHypotheses":"Non-canonical proteins contribute disproportionately to immunopeptidome; Cryptic proteins have preferential access to MHC pathway","strengths":"Integrated multi-omics approach, quantitative analysis, clinical samples","weaknesses":"Limited tissue types, B cell lymphoma focus","citation":"Hardy, M.P., et al. (2021). Most non-canonical proteins uniquely populate the proteome or immunopeptidome. Cell Rep 34, 108815.","notes":"Cryptic proteins generate MHC peptides 5-fold more efficiently. Major finding for non-canonical sources.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"chen2021","title":"An Integrated Approach for Discovering Noncanonical MHC-I Peptides Encoded by Small Open Reading Frames","authors":"Lei Chen, Yuanliang Zhang, Ying Yang, et al.","journal":"Journal of the American Society for Mass Spectrometry","year":"2021","doi":"10.1021/jasms.1c00076","url":"https://pubs.acs.org/doi/10.1021/jasms.1c00076","keyAssumptions":"Small ORFs do not contribute significantly to immunopeptidome; Detection methods are adequate for non-canonical peptides","keyHypotheses":"Systematic approaches can identify sORF-derived immunopeptides; Multiple complementary pipelines improve detection","strengths":"Three-pipeline approach, Ribo-seq integration, experimental validation","weaknesses":"Limited to tumor cell lines, computational complexity","citation":"Chen, L., et al. (2021). An Integrated Approach for Discovering Noncanonical MHC-I Peptides Encoded by Small Open Reading Frames. J Am Soc Mass Spectrom 32, 2015-2024.","notes":"308 noncanonical immunopeptides identified. Methodological advance for sORF detection.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"mishto2024","title":"Protein degradation by human 20S proteasomes elucidates the interplay between peptide hydrolysis and splicing","authors":"Michele Mishto, et al.","journal":"Nature Communications","year":"2024","doi":"10.1038/s41467-024-45339-3","url":"https://www.nature.com/articles/s41467-024-45339-3","keyAssumptions":"Proteasomes only perform peptide hydrolysis; Splicing is controversial or minor","keyHypotheses":"Proteasomes catalyze both hydrolysis and splicing; Both activities follow defined rules","strengths":"Comprehensive analysis of 15 proteins, novel computational workflow, mechanistic insights","weaknesses":"In vitro studies only, limited physiological relevance validation","citation":"Mishto, M., et al. (2024). Protein degradation by human 20S proteasomes elucidates the interplay between peptide hydrolysis and splicing. Nat Commun 15, 1034.","notes":"Confirms proteasomal splicing capability. Adds complexity to antigen processing understanding.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"feng2025","title":"A unified deep framework for peptide–major histocompatibility complex–T cell receptor binding prediction","authors":"Jiannan Feng, et al.","journal":"Nature Machine Intelligence","year":"2025","doi":"10.1038/s42256-025-01002-0","url":"https://www.nature.com/articles/s42256-025-01002-0","keyAssumptions":"Peptide-MHC and TCR interactions must be analyzed separately; Individual component prediction is sufficient","keyHypotheses":"Unified framework can improve prediction accuracy; Simultaneous modeling of all three components is advantageous","strengths":"State-of-the-art performance, interpretable insights, clinical validation","weaknesses":"Computational complexity, training data requirements","citation":"Feng, J., et al. (2025). A unified deep framework for peptide–major histocompatibility complex–T cell receptor binding prediction. Nat Mach Intell.","notes":"UniPMT achieves 15% improvement. Represents next-generation computational approaches.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"chang2025","title":"Massively parallel immunopeptidome by DNA sequencing provides population-scale epitope discovery","authors":"Howard Y. Chang, et al.","journal":"Nature Genetics","year":"2025","doi":"10.1038/s41588-025-02268-1","url":"https://www.nature.com/articles/s41588-025-02268-1","keyAssumptions":"MS-based approaches capture complete immunopeptidome; Large sample inputs required","keyHypotheses":"DNA sequencing can overcome MS sensitivity limitations; Population-scale analysis is feasible","strengths":"Population-wide scale, detects low-abundance peptides, overcomes MS limitations","weaknesses":"Requires specialized genetic systems, limited to certain contexts","citation":"Chang, H.Y., et al. (2025). Massively parallel immunopeptidome by DNA sequencing provides population-scale epitope discovery. Nat Genet.","notes":"Paradigm shift from MS to sequencing-based detection. Enables population-scale studies.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"perez2019","title":"Analysis of Secondary Structure Biases in Naturally Presented HLA-I Ligands","authors":"Marta A. S. Perez, Michal Bassani-Sternberg, George Coukos, David Gfeller, Vincent Zoete","journal":"Frontiers in Immunology","year":"2019","doi":"10.3389/fimmu.2019.02731","url":"https://www.frontiersin.org/articles/10.3389/fimmu.2019.02731/full","keyAssumptions":"Secondary structure is irrelevant to peptide sampling; Presentation is sequence-driven only","keyHypotheses":"Structural context influences peptide presentation; Helical fragments are preferentially sampled","strengths":"3D structural mapping, systematic analysis, heuristic search methodology","weaknesses":"Limited to 9-mers, requires structural data availability","citation":"Perez, M.A.S., et al. (2019). Analysis of Secondary Structure Biases in Naturally Presented HLA-I Ligands. Front Immunol 10, 2731.","notes":"First systematic analysis of structural biases in MHC presentation. Reveals helical preference.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"li2023","title":"Crystal structures of MHC class I complexes reveal the elusive intermediate conformations explored during peptide editing","authors":"Lenong Li, Xubiao Peng, Mansoor Batliwala, Marlene Bouvier","journal":"Nature Communications","year":"2023","doi":"10.1038/s41467-023-40736-6","url":"https://www.nature.com/articles/s41467-023-40736-6","keyAssumptions":"MHC I conformations during editing are poorly understood; Static structures represent functional states","keyHypotheses":"MHC I explores multiple conformational states during peptide selection; Intermediate conformations are structurally defined","strengths":"High-resolution crystal structures, molecular dynamics validation, mechanistic insights","weaknesses":"In vitro conditions, limited peptide types studied","citation":"Li, L., et al. (2023). Crystal structures of MHC class I complexes reveal the elusive intermediate conformations explored during peptide editing. Nat Commun 14, 5122.","notes":"Structural visualization of peptide editing process. Key for understanding selection mechanisms.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"merbl2025","title":"Cell-autonomous innate immunity by proteasome-derived defence peptides","authors":"Yifat Merbl, et al.","journal":"Nature","year":"2025","doi":"10.1038/s41586-025-08615-w","url":"https://www.nature.com/articles/s41586-025-08615-w","keyAssumptions":"Proteasome function is limited to protein degradation and antigen processing; Antimicrobial peptides come from dedicated pathways","keyHypotheses":"Proteasomes constitutively generate defence peptides; Bacterial infection enhances antimicrobial activity","strengths":"Novel biological function discovered, mechanistic insights, therapeutic potential","weaknesses":"Early stage findings, limited pathogen testing","citation":"Merbl, Y., et al. (2025). Cell-autonomous innate immunity by proteasome-derived defence peptides. Nature.","notes":"Revolutionary discovery of proteasome antimicrobial function. Expands proteasome role beyond MHC.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"tran2020","title":"Thermostability profiling of MHC-bound peptides: a new dimension in immunopeptidomics and aid for immunotherapy design","authors":"Eric Tran, et al.","journal":"Nature Communications","year":"2020","doi":"10.1038/s41467-020-20166-4","url":"https://www.nature.com/articles/s41467-020-20166-4","keyAssumptions":"pMHC stability assessment only possible for isolated peptides; Stability profiles are narrow","keyHypotheses":"MS can measure pMHC stability for thousands of ligands simultaneously; Stability improves immunogenicity prediction","strengths":"High-throughput stability measurement, improved immunogenicity prediction, clinical applications","weaknesses":"Method complexity, requires specialized protocols","citation":"Tran, E., et al. (2020). Thermostability profiling of MHC-bound peptides: a new dimension in immunopeptidomics and aid for immunotherapy design. Nat Commun 11, 6305.","notes":"New dimension for immunopeptidome analysis. Enables stability-based neoepitope selection.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"rana2024a","title":"Immunoproteasome Activation Expands the MHC Class I Immunopeptidome, Unmasks Neoantigens, and Enhances T-cell Anti-Myeloma Activity","authors":"Priyanka S Rana, James J Ignatz-Hoover, et al.","journal":"Molecular Cancer Therapeutics","year":"2024","doi":"10.1158/1535-7163.MCT-23-0931","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC11612626/","keyAssumptions":"Standard proteasome function adequately represents antigen processing; Immunoproteasome differences are minor","keyHypotheses":"Immunoproteasome activation significantly expands immunopeptidome; Enhanced presentation improves T-cell responses","strengths":"Clinical relevance, systematic analysis, therapeutic validation","weaknesses":"Limited to myeloma, specific patient populations","citation":"Rana, P.S., et al. (2024). Immunoproteasome Activation Expands the MHC Class I Immunopeptidome, Unmasks Neoantigens, and Enhances T-cell Anti-Myeloma Activity. Mol Cancer Ther 23, 1743-1760.","notes":"Therapeutic approach to expand antigen presentation. Validates immunoproteasome targeting.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"zhao2024","title":"ImmuneApp for HLA-I epitope prediction and immunopeptidome analysis","authors":"Zhongming Zhao, et al.","journal":"Nature Communications","year":"2024","doi":"10.1038/s41467-024-53296-0","url":"https://www.nature.com/articles/s41467-024-53296-0","keyAssumptions":"Current prediction methods are adequate; Multi-allelic deconvolution is intractable","keyHypotheses":"Integrated mono/multi-allelic training improves prediction; Model-based deconvolution is superior","strengths":"Large-scale analysis (216 samples), improved performance, systematic deconvolution","weaknesses":"Computational requirements, training data bias","citation":"Zhao, Z., et al. (2024). ImmuneApp for HLA-I epitope prediction and immunopeptidome analysis. Nat Commun 15, 8854.","notes":"Advanced computational framework for immunopeptidomics. Enables large-scale systematic analysis.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"ji2024","title":"Widespread stable noncanonical peptides identified by integrated analyses of ribosome profiling and ORF features","authors":"Zhe Ji, et al.","journal":"Nature Communications","year":"2024","doi":"10.1038/s41467-024-46240-9","url":"https://www.nature.com/articles/s41467-024-46240-9","keyAssumptions":"Most noncanonical translation is spurious; Short peptides are inherently unstable","keyHypotheses":"PepScore can predict peptide stability; Stable noncanonical proteins follow conventional rules","strengths":"Systematic approach, experimental validation, statistical framework","weaknesses":"Limited to specific organisms, requires extensive data","citation":"Ji, Z., et al. (2024). Widespread stable noncanonical peptides identified by integrated analyses of ribosome profiling and ORF features. Nat Commun 15, 1839.","notes":"Framework for identifying functional noncanonical peptides. Critical for expanding proteome annotation.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"xu2024","title":"MHC-I-presented non-canonical antigens expand the cancer immunotherapy targets in acute myeloid leukemia","authors":"Juan Xu, et al.","journal":"Scientific Data","year":"2024","doi":"10.1038/s41597-024-03660-y","url":"https://www.nature.com/articles/s41597-024-03660-y","keyAssumptions":"Canonical proteins provide sufficient therapeutic targets; Non-canonical contributions are minor","keyHypotheses":"Non-canonical peptides are high-quality therapeutic targets; ncMAPs improve prognostic models","strengths":"Clinical validation, systematic framework, prognostic value demonstrated","weaknesses":"Limited to AML, specific patient populations","citation":"Xu, J., et al. (2024). MHC-I-presented non-canonical antigens expand the cancer immunotherapy targets in acute myeloid leukemia. Sci Data 11, 760.","notes":"Clinical validation of non-canonical antigens. Demonstrates therapeutic relevance in cancer.","addedDate":"2025-08-25T23:45:00.000Z"}
{"id":"xue2024","title":"Geometric deep learning improves generalizability of MHC-bound peptide predictions","authors":"Li C. Xue, et al.","journal":"Communications Biology","year":"2024","doi":"10.1038/s42003-024-07292-1","url":"https://www.nature.com/articles/s42003-024-07292-1","keyAssumptions":"Large training datasets are always required for accurate prediction; Sequence-based methods are sufficient","keyHypotheses":"Structural information improves generalizability; 3D-SSL can outperform sequence methods with less data","strengths":"90x data efficiency, superior generalization, structure-based insights","weaknesses":"Requires structural information, limited allele coverage","citation":"Xue, L.C., et al. (2024). Geometric deep learning improves generalizability of MHC-bound peptide predictions. Commun Biol 7, 1613.","notes":"Structure-based GDL shows remarkable efficiency. Challenges data requirements assumption.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"trentini2020","title":"Role for ribosome-associated quality control in sampling proteins for MHC class I-mediated antigen presentation","authors":"Débora Broch Trentini, Matteo Pecoraro, et al.","journal":"PNAS","year":"2020","doi":"10.1073/pnas.1914401117","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC7049129/","keyAssumptions":"Protein degradation for MHC presentation is post-translational; Quality control and presentation are separate","keyHypotheses":"Co-translational quality control contributes to antigen sampling; Ribosome stalling enhances MHC presentation","strengths":"Novel mechanistic insight, links translation to presentation, experimental validation","weaknesses":"Limited scope of proteins studied, model system limitations","citation":"Trentini, D.B., et al. (2020). Role for ribosome-associated quality control in sampling proteins for MHC class I-mediated antigen presentation. PNAS 117, 4099-4108.","notes":"Links protein synthesis quality to immune surveillance. Important mechanistic insight.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"balakrishnan2025","title":"Unlocking the secrets of the immunopeptidome: MHC molecules, ncRNA peptides, and vesicles in immune response","authors":"Arpita Balakrishnan, Gabriela Winiarek, Olga Hołówka, Jakub Godlewski, Agnieszka Bronisz","journal":"Frontiers in Immunology","year":"2025","doi":"10.3389/fimmu.2025.1540431","url":"https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2025.1540431/full","keyAssumptions":"Only canonical protein-derived peptides are clinically relevant; Extracellular vesicles don't significantly transport HLA peptides","keyHypotheses":"ncRNA-derived peptides contribute to immunopeptidome; EVs enable systemic distribution of immunopeptides","strengths":"Novel focus on ncRNA peptides, EV transport mechanism, clinical implications","weaknesses":"Review paper, limited experimental data, early-stage field","citation":"Balakrishnan, A., et al. (2025). Unlocking the secrets of the immunopeptidome: MHC molecules, ncRNA peptides, and vesicles in immune response. Front Immunol 16, 1540431.","notes":"Emerging area of ncRNA-derived antigens. Potential for novel therapeutic targets.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"laumont2016","title":"Global proteogenomic analysis of human MHC class I-associated peptides derived from non-canonical reading frames","authors":"Céline M Laumont, Tariq Daouda, Jean-Philippe Laverdure, et al.","journal":"Nature Communications","year":"2016","doi":"10.1038/ncomms10238","url":"https://www.nature.com/articles/ncomms10238","keyAssumptions":"Only canonical reading frames contribute to immunopeptidome; Non-AUG initiation is rare","keyHypotheses":"Non-canonical reading frames contribute significantly to MHC presentation; Proteogenomic approaches reveal hidden antigens","strengths":"Pioneering proteogenomic approach, systematic analysis, clinical samples","weaknesses":"Older methodology, limited computational tools available then","citation":"Laumont, C.M., et al. (2016). Global proteogenomic analysis of human MHC class I-associated peptides derived from non-canonical reading frames. Nat Commun 7, 10238.","notes":"Pioneering work on non-canonical reading frame contribution. Foundation for later studies.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"koohi2023","title":"CapsNet-MHC predicts peptide-MHC class I binding based on capsule neural networks","authors":"Somayyeh Koohi, et al.","journal":"Communications Biology","year":"2023","doi":"10.1038/s42003-023-04867-2","url":"https://www.nature.com/articles/s42003-023-04867-2","keyAssumptions":"Standard deep learning architectures are optimal for MHC binding prediction; Spatial relationships are not critical","keyHypotheses":"Capsule networks better capture peptide-MHC spatial relationships; Novel architectures improve prediction accuracy","strengths":"Novel architecture, good performance with less data, interpretable features","weaknesses":"Limited comparative evaluation, computational complexity","citation":"Koohi, S., et al. (2023). CapsNet-MHC predicts peptide-MHC class I binding based on capsule neural networks. Commun Biol 14, 4867.","notes":"Innovative neural network architecture. Demonstrates value of spatial relationship modeling.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"yu2024","title":"Structure-aware deep model for MHC-II peptide binding affinity prediction","authors":"Ying Yu, Lipeng Zu, Jiaye Jiang, et al.","journal":"BMC Genomics","year":"2024","doi":"10.1186/s12864-023-09900-6","url":"https://bmcgenomics.biomedcentral.com/articles/10.1186/s12864-023-09900-6","keyAssumptions":"Sequence information alone is sufficient for MHC-II binding prediction; Structure adds minimal value","keyHypotheses":"Structural information significantly improves MHC-II binding prediction; Multi-modal approaches are superior","strengths":"Structure integration, MHC-II focus, systematic evaluation","weaknesses":"Limited to MHC-II, computational complexity, structure availability","citation":"Yu, Y., et al. (2024). Structure-aware deep model for MHC-II peptide binding affinity prediction. BMC Genomics 25, 127.","notes":"Demonstrates value of structural information in MHC-II prediction. Complements MHC-I focused work.","addedDate":"2025-08-25T23:26:00.000Z"}