{"id":"wahle2024","title":"IMBAS-MS Discovers Organ-Specific HLA Peptide Patterns in Plasma","authors":"Maria Wahle, Marvin Thielert, Maximilian Zwiebel, Patricia Skowronek, Wen-Feng Zeng, Matthias Mann","journal":"Molecular & Cellular Proteomics","year":"2024","doi":"10.1016/j.mcpro.2023.100671","url":"https://www.mcponline.org/article/S1535-9476(23)00200-1/fulltext","keyAssumptions":"Large plasma volumes (mL scale) required for immunopeptidomics; Complex workflows limit clinical translation","keyHypotheses":"Automated small-volume approaches can enable clinical-scale immunopeptidomics; Plasma HLA peptides reflect tissue-specific origins","strengths":"Automated workflow, 200μL plasma requirement, 30min analysis time, >5000 peptides identified","weaknesses":"Limited to specific HLA types, requires specialized equipment","citation":"Wahle, M., et al. (2024). IMBAS-MS Discovers Organ-Specific HLA Peptide Patterns in Plasma. Mol Cell Proteomics.","notes":"Revolutionary reduction in sample volume requirements. Enables clinical translation of immunopeptidomics.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"walz2023","title":"TOFIMS mass spectrometry-based immunopeptidomics refines tumor antigen discovery","authors":"Juliane S. Walz, et al.","journal":"Nature Communications","year":"2023","doi":"10.1038/s41467-023-42692-7","url":"https://www.nature.com/articles/s41467-023-42692-7","keyAssumptions":"Standard Orbitrap MS represents technical ceiling for immunopeptidomics sensitivity","keyHypotheses":"Ion mobility separation can improve immunopeptidomics sensitivity without specificity loss","strengths":"Higher sensitivity, improved MS/MS scan rates, better tumor antigen discovery","weaknesses":"Requires specialized instrumentation, limited comparative data","citation":"Walz, J.S., et al. (2023). TOFIMS mass spectrometry-based immunopeptidomics refines tumor antigen discovery. Nat Commun 14, 7574.","notes":"Next-generation MS technology for immunopeptidomics. Challenges assumed technical limitations.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"bruno2023","title":"High-throughput, targeted MHC class I immunopeptidomics using a functional genetics screening platform","authors":"Peter M Bruno, Richard T Timms, et al.","journal":"Nature Biotechnology","year":"2023","doi":"10.1038/s41587-022-01566-x","url":"https://www.nature.com/articles/s41587-022-01566-x","keyAssumptions":"Discovery-based MS is the only unbiased approach to identify MHC ligands","keyHypotheses":"Functional genetics can enable targeted immunopeptidomics; MHC trafficking requires stable peptide binding","strengths":"High-throughput, targeted approach, functional validation built-in","weaknesses":"Requires prior knowledge of target sequences, limited to known proteins","citation":"Bruno, P.M., et al. (2023). High-throughput, targeted MHC class I immunopeptidomics using a functional genetics screening platform. Nat Biotechnol 41, 980-992.","notes":"EpiScan platform enables focused analysis. Complements discovery approaches.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"kubiniok2022","title":"Understanding the constitutive presentation of MHC class I immunopeptidomes in primary tissues","authors":"Peter Kubiniok, Ana Marcu, Leon Bichmann, et al.","journal":"iScience","year":"2022","doi":"10.1016/j.isci.2022.103768","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC8810409/","keyAssumptions":"Protein abundance is primary determinant of MHC presentation; Presentation patterns are largely random","keyHypotheses":"MHC immunopeptidome follows systematic, evolutionarily conserved patterns; Tissue-specific biases exist independent of abundance","strengths":"Cross-species analysis, primary tissue focus, evolutionary conservation evidence","weaknesses":"Limited tissue types analyzed, technical replication challenges","citation":"Kubiniok, P., et al. (2022). Understanding the constitutive presentation of MHC class I immunopeptidomes in primary tissues. iScience 25, 103768.","notes":"Fundamental discovery of systematic presentation biases. Key paper for our project.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"mamrosh2023","title":"Quantitative measurement of the requirement of diverse protein degradation pathways in MHC class I peptide presentation","authors":"Jennifer L Mamrosh, David J Sherman, et al.","journal":"Science Advances","year":"2023","doi":"10.1126/sciadv.ade7890","url":"https://www.science.org/doi/10.1126/sciadv.ade7890","keyAssumptions":"All MHC class I peptides require ubiquitin-proteasome system for generation","keyHypotheses":"Alternative degradation pathways contribute significantly to MHC presentation; UPS-independent pathways exist","strengths":"Systematic pathway analysis, quantitative measurements, comprehensive inhibitor studies","weaknesses":"Limited to cell lines, artificial inhibition conditions","citation":"Mamrosh, J.L., et al. (2023). Quantitative measurement of the requirement of diverse protein degradation pathways in MHC class I peptide presentation. Sci Adv 9, eade7890.","notes":"30% of MHC peptides are UPS-independent. Challenges fundamental assumption.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"hardy2021","title":"Most non-canonical proteins uniquely populate the proteome or immunopeptidome","authors":"Marie-Pierre Hardy, Maria Virginia Ruiz Cuevas, et al.","journal":"Cell Reports","year":"2021","doi":"10.1016/j.celrep.2021.108815","url":"https://www.cell.com/cell-reports/retrieve/pii/S2211124721001297","keyAssumptions":"Canonical proteins dominate MHC presentation; Non-canonical contributions are negligible","keyHypotheses":"Non-canonical proteins contribute disproportionately to immunopeptidome; Cryptic proteins have preferential access to MHC pathway","strengths":"Integrated multi-omics approach, quantitative analysis, clinical samples","weaknesses":"Limited tissue types, B cell lymphoma focus","citation":"Hardy, M.P., et al. (2021). Most non-canonical proteins uniquely populate the proteome or immunopeptidome. Cell Rep 34, 108815.","notes":"Cryptic proteins generate MHC peptides 5-fold more efficiently. Major finding for non-canonical sources.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"chen2021","title":"An Integrated Approach for Discovering Noncanonical MHC-I Peptides Encoded by Small Open Reading Frames","authors":"Lei Chen, Yuanliang Zhang, Ying Yang, et al.","journal":"Journal of the American Society for Mass Spectrometry","year":"2021","doi":"10.1021/jasms.1c00076","url":"https://pubs.acs.org/doi/10.1021/jasms.1c00076","keyAssumptions":"Small ORFs do not contribute significantly to immunopeptidome; Detection methods are adequate for non-canonical peptides","keyHypotheses":"Systematic approaches can identify sORF-derived immunopeptides; Multiple complementary pipelines improve detection","strengths":"Three-pipeline approach, Ribo-seq integration, experimental validation","weaknesses":"Limited to tumor cell lines, computational complexity","citation":"Chen, L., et al. (2021). An Integrated Approach for Discovering Noncanonical MHC-I Peptides Encoded by Small Open Reading Frames. J Am Soc Mass Spectrom 32, 2015-2024.","notes":"308 noncanonical immunopeptides identified. Methodological advance for sORF detection.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"mishto2024","title":"Protein degradation by human 20S proteasomes elucidates the interplay between peptide hydrolysis and splicing","authors":"Michele Mishto, et al.","journal":"Nature Communications","year":"2024","doi":"10.1038/s41467-024-45339-3","url":"https://www.nature.com/articles/s41467-024-45339-3","keyAssumptions":"Proteasomes only perform peptide hydrolysis; Splicing is controversial or minor","keyHypotheses":"Proteasomes catalyze both hydrolysis and splicing; Both activities follow defined rules","strengths":"Comprehensive analysis of 15 proteins, novel computational workflow, mechanistic insights","weaknesses":"In vitro studies only, limited physiological relevance validation","citation":"Mishto, M., et al. (2024). Protein degradation by human 20S proteasomes elucidates the interplay between peptide hydrolysis and splicing. Nat Commun 15, 1034.","notes":"Confirms proteasomal splicing capability. Adds complexity to antigen processing understanding.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"feng2025","title":"A unified deep framework for peptide–major histocompatibility complex–T cell receptor binding prediction","authors":"Jiannan Feng, et al.","journal":"Nature Machine Intelligence","year":"2025","doi":"10.1038/s42256-025-01002-0","url":"https://www.nature.com/articles/s42256-025-01002-0","keyAssumptions":"Peptide-MHC and TCR interactions must be analyzed separately; Individual component prediction is sufficient","keyHypotheses":"Unified framework can improve prediction accuracy; Simultaneous modeling of all three components is advantageous","strengths":"State-of-the-art performance, interpretable insights, clinical validation","weaknesses":"Computational complexity, training data requirements","citation":"Feng, J., et al. (2025). A unified deep framework for peptide–major histocompatibility complex–T cell receptor binding prediction. Nat Mach Intell.","notes":"UniPMT achieves 15% improvement. Represents next-generation computational approaches.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"xue2024","title":"Geometric deep learning improves generalizability of MHC-bound peptide predictions","authors":"Li C. Xue, et al.","journal":"Communications Biology","year":"2024","doi":"10.1038/s42003-024-07292-1","url":"https://www.nature.com/articles/s42003-024-07292-1","keyAssumptions":"Large training datasets are always required for accurate prediction; Sequence-based methods are sufficient","keyHypotheses":"Structural information improves generalizability; 3D-SSL can outperform sequence methods with less data","strengths":"90x data efficiency, superior generalization, structure-based insights","weaknesses":"Requires structural information, limited allele coverage","citation":"Xue, L.C., et al. (2024). Geometric deep learning improves generalizability of MHC-bound peptide predictions. Commun Biol 7, 1613.","notes":"Structure-based GDL shows remarkable efficiency. Challenges data requirements assumption.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"trentini2020","title":"Role for ribosome-associated quality control in sampling proteins for MHC class I-mediated antigen presentation","authors":"Débora Broch Trentini, Matteo Pecoraro, et al.","journal":"PNAS","year":"2020","doi":"10.1073/pnas.1914401117","url":"https://pmc.ncbi.nlm.nih.gov/articles/PMC7049129/","keyAssumptions":"Protein degradation for MHC presentation is post-translational; Quality control and presentation are separate","keyHypotheses":"Co-translational quality control contributes to antigen sampling; Ribosome stalling enhances MHC presentation","strengths":"Novel mechanistic insight, links translation to presentation, experimental validation","weaknesses":"Limited scope of proteins studied, model system limitations","citation":"Trentini, D.B., et al. (2020). Role for ribosome-associated quality control in sampling proteins for MHC class I-mediated antigen presentation. PNAS 117, 4099-4108.","notes":"Links protein synthesis quality to immune surveillance. Important mechanistic insight.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"balakrishnan2025","title":"Unlocking the secrets of the immunopeptidome: MHC molecules, ncRNA peptides, and vesicles in immune response","authors":"Arpita Balakrishnan, Gabriela Winiarek, Olga Hołówka, Jakub Godlewski, Agnieszka Bronisz","journal":"Frontiers in Immunology","year":"2025","doi":"10.3389/fimmu.2025.1540431","url":"https://www.frontiersin.org/journals/immunology/articles/10.3389/fimmu.2025.1540431/full","keyAssumptions":"Only canonical protein-derived peptides are clinically relevant; Extracellular vesicles don't significantly transport HLA peptides","keyHypotheses":"ncRNA-derived peptides contribute to immunopeptidome; EVs enable systemic distribution of immunopeptides","strengths":"Novel focus on ncRNA peptides, EV transport mechanism, clinical implications","weaknesses":"Review paper, limited experimental data, early-stage field","citation":"Balakrishnan, A., et al. (2025). Unlocking the secrets of the immunopeptidome: MHC molecules, ncRNA peptides, and vesicles in immune response. Front Immunol 16, 1540431.","notes":"Emerging area of ncRNA-derived antigens. Potential for novel therapeutic targets.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"laumont2016","title":"Global proteogenomic analysis of human MHC class I-associated peptides derived from non-canonical reading frames","authors":"Céline M Laumont, Tariq Daouda, Jean-Philippe Laverdure, et al.","journal":"Nature Communications","year":"2016","doi":"10.1038/ncomms10238","url":"https://www.nature.com/articles/ncomms10238","keyAssumptions":"Only canonical reading frames contribute to immunopeptidome; Non-AUG initiation is rare","keyHypotheses":"Non-canonical reading frames contribute significantly to MHC presentation; Proteogenomic approaches reveal hidden antigens","strengths":"Pioneering proteogenomic approach, systematic analysis, clinical samples","weaknesses":"Older methodology, limited computational tools available then","citation":"Laumont, C.M., et al. (2016). Global proteogenomic analysis of human MHC class I-associated peptides derived from non-canonical reading frames. Nat Commun 7, 10238.","notes":"Pioneering work on non-canonical reading frame contribution. Foundation for later studies.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"koohi2023","title":"CapsNet-MHC predicts peptide-MHC class I binding based on capsule neural networks","authors":"Somayyeh Koohi, et al.","journal":"Communications Biology","year":"2023","doi":"10.1038/s42003-023-04867-2","url":"https://www.nature.com/articles/s42003-023-04867-2","keyAssumptions":"Standard deep learning architectures are optimal for MHC binding prediction; Spatial relationships are not critical","keyHypotheses":"Capsule networks better capture peptide-MHC spatial relationships; Novel architectures improve prediction accuracy","strengths":"Novel architecture, good performance with less data, interpretable features","weaknesses":"Limited comparative evaluation, computational complexity","citation":"Koohi, S., et al. (2023). CapsNet-MHC predicts peptide-MHC class I binding based on capsule neural networks. Commun Biol 14, 4867.","notes":"Innovative neural network architecture. Demonstrates value of spatial relationship modeling.","addedDate":"2025-08-25T23:26:00.000Z"}
{"id":"yu2024","title":"Structure-aware deep model for MHC-II peptide binding affinity prediction","authors":"Ying Yu, Lipeng Zu, Jiaye Jiang, et al.","journal":"BMC Genomics","year":"2024","doi":"10.1186/s12864-023-09900-6","url":"https://bmcgenomics.biomedcentral.com/articles/10.1186/s12864-023-09900-6","keyAssumptions":"Sequence information alone is sufficient for MHC-II binding prediction; Structure adds minimal value","keyHypotheses":"Structural information significantly improves MHC-II binding prediction; Multi-modal approaches are superior","strengths":"Structure integration, MHC-II focus, systematic evaluation","weaknesses":"Limited to MHC-II, computational complexity, structure availability","citation":"Yu, Y., et al. (2024). Structure-aware deep model for MHC-II peptide binding affinity prediction. BMC Genomics 25, 127.","notes":"Demonstrates value of structural information in MHC-II prediction. Complements MHC-I focused work.","addedDate":"2025-08-25T23:26:00.000Z"}