{"id":"EXP001","title":"Structural Determinism Validation","assumption":"MHC presentation is primarily driven by protein abundance and random processing","hypothesis":"MHC presentation bias is systematically determined by intrinsic protein structural features (disorder propensity, degradation motifs, subcellular localization) rather than abundance, creating predictable visibility classes","evaluationPlan":"Multivariate regression analysis of 15,000+ human proteins: Presentation Index ~ Structural Disorder + Degradation Motifs + Subcellular Localization + Controls. Cross-validate across tissues and HLA allotypes.","implications":"Would reshape immune surveillance understanding, enable rational vaccine design, explain consistent pathogen immune evasion","relatedWork":"Builds on MHC peptidome studies (Bassani-Sternberg, Abelin) and protein disorder prediction (IUPred2A, PEST-find)","milestones":"Month 1: Data curation and feature prediction; Month 2: Statistical modeling; Month 3: Cross-validation and interpretation; Month 4: Manuscript preparation","successCriteria":"Structural features predict presentation bias with >20% improvement over abundance-only model (AUC >0.75). Key structural classes show significant differences (p<0.001, effect size >0.5)","priority":"high","status":"proposed","notes":"Core hypothesis - highest priority for validation. Computational experiment with existing data.","createdDate":"2025-08-25T23:42:50.000Z"}
{"id":"EXP002","title":"Micro-protein Invisibility Test","assumption":"All proteins are equally likely to contribute peptides per unit mass regardless of size","hypothesis":"Small proteins (<100 amino acids) and cryptic ORFs are systematically under-represented despite high expression, due to insufficient proteasomal processing sites and rapid degradation kinetics","evaluationPlan":"Size-stratified analysis of presentation rates across protein length classes. Correlation analysis between processing site density and visibility. Targeted MS validation of selected small proteins.","implications":"Would reveal immune surveillance blind spots affecting viral evasion, tumor neoantigens, autoimmunity","relatedWork":"Related to micropeptide biology (Couso, Andrews) and alternative ORF discovery (Ji, Aspden)","milestones":"Month 1: Small protein catalog compilation; Month 2: Presentation rate analysis; Month 3: Processing site prediction and correlation; Month 4: Targeted MS validation","successCriteria":"Proteins <100 AA show >2-fold lower presentation per amino acid. Processing site density correlates with visibility (r>0.6). Targeted validation confirms predictions for >80% tested proteins","priority":"high","status":"proposed","notes":"Critical for understanding size-based immune surveillance bias. Requires both computational and experimental validation.","createdDate":"2025-08-25T23:42:50.000Z"}
{"id":"EXP003","title":"Tissue-Specific Antigenome Mapping","assumption":"Immunopeptidome findings from accessible tissues represent universal patterns","hypothesis":"Each tissue has fundamentally different antigenome signatures based on unique proteasomal activity, stress responses, metabolic states","evaluationPlan":"Hierarchical clustering of 8+ tissues by presentation signatures. Correlation analysis with tissue-specific gene expression. Validation with tissue-specific cell culture experiments.","implications":"Would transform precision immunotherapy requiring tissue-specific strategies","relatedWork":"Extends tissue-specific immunopeptidome studies (Pearson, Purcell) and GTEx expression atlas","milestones":"Month 1: Tissue dataset curation; Month 2-3: Presentation signature calculation and clustering; Month 4: Expression correlation analysis; Month 5: Cell culture validation","successCriteria":"Tissue pairs show >30% difference in presentation rankings. Tissue-specific proteins show enhanced presentation in cognate tissues (enrichment >2-fold). Clustering recapitulates known tissue relationships.","priority":"medium","status":"proposed","notes":"Important for clinical applications but secondary to core structural hypotheses.","createdDate":"2025-08-25T23:42:50.000Z"}
{"id":"EXP004","title":"Dynamic Stress-Response Antigenome","assumption":"MHC presentation remains relatively stable across cellular states","hypothesis":"Cellular stress fundamentally rewires the antigenome by altering proteasomal targeting, revealing normally invisible proteins","evaluationPlan":"Time-course MHC peptide analysis under defined stress conditions (heat shock, oxidative stress, ER stress, proteasome inhibition). Map temporal dynamics of presentation changes.","implications":"Would enable timing-based interventions, explain variable immune responses","relatedWork":"Builds on stress response immunopeptidome studies (Keller, Chong) and proteasome regulation literature","milestones":"Month 1: Protocol optimization; Month 2-3: Stress time-course experiments; Month 4-5: MS analysis and data processing; Month 6: Temporal pattern analysis and validation","successCriteria":"Stress conditions increase presentation of normally invisible proteins by >50%. Distinct temporal patterns for different stress types. Recovery experiments show reversible changes.","priority":"medium","status":"proposed","notes":"High impact but resource-intensive. Can be delayed if resources are limited.","createdDate":"2025-08-25T23:42:50.000Z"}
{"id":"CTL001","title":"Abundance Normalization Control","assumption":"Structural effects are independent of protein abundance","hypothesis":"Observed structural effects persist even after rigorous abundance normalization","evaluationPlan":"Repeat structural determinism analysis with multiple abundance correction methods. Test robustness to different normalization approaches.","implications":"Critical for establishing causal relationship between structure and presentation bias","relatedWork":"Methodological control building on proteomics normalization literature","milestones":"Month 1: Multiple normalization method implementation; Month 2: Robustness testing; Month 3: Sensitivity analysis","successCriteria":"Structural effects remain significant (p<0.001) across all normalization methods. Effect sizes remain >0.3 after abundance correction.","priority":"high","status":"proposed","notes":"Essential control experiment - must be completed alongside EXP001.","createdDate":"2025-08-25T23:42:50.000Z"}